[
    {
        "title": "Advanced Mathematics",
        "posted_by": "Dr. John Smith",
        "image_url": "https://i.postimg.cc/rm97s59B/1.png",
        "price": 150.00,
        "short_description": "Dive deep into advanced calculus and algebra with Dr. Smith.",
        "long_description": "This course covers advanced topics in mathematics, including calculus, algebra, and differential equations. Dr. John Smith, a renowned mathematician, will guide you through complex concepts with practical examples and problem-solving sessions. Ideal for students looking to excel in their math skills. You'll gain a deeper understanding of mathematical theories, learn how to apply them in real-world scenarios, and prepare for higher education or professional applications in science, technology, engineering, and mathematics (STEM) fields.",
        "total_enrolment": 120
    },
    {
        "title": "Introduction to Psychology",
        "posted_by": "Prof. Emily Johnson",
        "image_url": "https://i.postimg.cc/q7yPfP6M/2.png",
        "price": 100.00,
        "short_description": "Explore the basics of human behavior and mental processes.",
        "long_description": "Discover the fascinating world of psychology with Prof. Emily Johnson. This introductory course delves into the study of the mind, behavior, and mental processes. Topics include cognitive development, personality theories, and psychological disorders. Perfect for those interested in understanding themselves and others better. By the end of the course, you'll have a solid foundation in psychology, helping you pursue further studies or careers in counseling, social work, and other related fields.",
        "total_enrolment": 200
    },
    {
        "title": "Modern Web Development",
        "posted_by": "Mr. Michael Brown",
        "image_url": "https://i.postimg.cc/QdR2y8ty/3.png",
        "price": 180.00,
        "short_description": "Learn the latest techniques in HTML, CSS, and JavaScript.",
        "long_description": "Join Mr. Michael Brown in this comprehensive course on modern web development. Learn to create responsive and dynamic websites using HTML, CSS, and JavaScript. The course also covers popular frameworks and libraries such as React and Node.js. Ideal for aspiring web developers and designers. Gain hands-on experience through projects, and build a professional portfolio to showcase your skills to potential employers.",
        "total_enrolment": 250
    },
    {
        "title": "Creative Writing Workshop",
        "posted_by": "Ms. Sarah Davis",
        "image_url": "https://i.postimg.cc/Ss4wmgcL/4.png",
        "price": 75.00,
        "short_description": "Enhance your writing skills with fun and interactive exercises.",
        "long_description": "Ms. Sarah Davis leads this engaging creative writing workshop designed to boost your storytelling abilities. Through various writing exercises and feedback sessions, you will learn to craft compelling narratives, develop characters, and refine your writing style. Suitable for writers of all levels. Whether you're writing fiction, non-fiction, or poetry, this workshop will help you enhance your creativity, improve your writing skills, and connect with fellow writers.",
        "total_enrolment": 80
      },
      {
        "title": "Basic Guitar Lessons",
        "posted_by": "Mr. James Wilson",
        "image_url": "https://i.postimg.cc/SNRHQ2YP/5.png",
        "price": 90.00,
        "short_description": "Learn to play the guitar from scratch with easy-to-follow lessons.",
        "long_description": "Mr. James Wilson offers an introductory course for those eager to learn guitar. Starting from the basics, you'll progress through chords, strumming patterns, and simple songs. This course is perfect for beginners looking to build a strong foundation in guitar playing. You'll learn proper techniques, music theory basics, and how to play your favorite songs. By the end of the course, you'll be able to play simple tunes and have the confidence to continue your musical journey.",
        "total_enrolment": 150
      },
      {
        "title": "Digital Marketing Essentials",
        "posted_by": "Ms. Laura Martinez",
        "image_url": "https://i.postimg.cc/YqPZvr1C/6.png",
        "price": 200.00,
        "short_description": "Master the fundamentals of SEO, social media, and online advertising.",
        "long_description": "Led by Ms. Laura Martinez, this course covers the core aspects of digital marketing. Learn about search engine optimization (SEO), social media marketing, content marketing, and online advertising. Gain practical skills to create effective marketing strategies and campaigns. Ideal for marketing professionals and business owners. The course includes real-world case studies, hands-on projects, and actionable insights to help you effectively promote your brand and drive business growth.",
        "total_enrolment": 300
      }
]